mimiflynn/esp8266-current-temp/lib/ApiWeatherGovClient.cpp
/**The MIT License (MIT)

Copyright (c) 2019 by Mimi Flynn

https://mimiflynn.com

based on WundergroundClient which is:

Copyright (c) 2015 by Daniel Eichhorn

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

See more at http://blog.squix.ch
*/

#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include "ApiWeatherGovClient.h"
bool usePM = false; // Set to true if you want to use AM/PM time disaply
bool isPM = false; // JJG added ///////////

ApiWeatherGovClient::ApiWeatherGovClient(boolean _isMetric) {
  isMetric = _isMetric;
}

// Added by fowlerk, 12/22/16, as an option to change metric setting other than at instantiation
void ApiWeatherGovClient::initMetric(boolean _isMetric) {
  isMetric = _isMetric;
}
// end add fowlerk, 12/22/16

void ApiWeatherGovClient::updateConditions(String apiKey, String language, String country, String state, String city) {
  isForecast = false;
  doUpdate("/api/" + apiKey + "/conditions/lang:" + language + "/q/" + country + "/" + state + "/" + city + ".json");
}

// wunderground change the API URL scheme:
// http://api.wunderground.com/api/<API-KEY>/conditions/lang:de/q/zmw:00000.215.10348.json
void ApiWeatherGovClient::updateConditions(String apiKey, String language, String zmwCode) {
  isForecast = false;
  doUpdate("/api/" + apiKey + "/conditions/lang:" + language + "/q/zmw:" + zmwCode + ".json");
}

void ApiWeatherGovClient::updateForecast(String apiKey, String language, String country, String state, String city) {
  isForecast = true;
  doUpdate("/api/" + apiKey + "/forecast10day/lang:" + language + "/q/" + country + "/" + state + "/" + city + ".json");
}

// JJG added ////////////////////////////////
void ApiWeatherGovClient::updateAstronomy(String apiKey, String language, String country, String state, String city) {
  isForecast = true;
  doUpdate("/api/" + apiKey + "/astronomy/lang:" + language + "/q/" + country + "/" + state + "/" + city + ".json");
}
// end JJG add  ////////////////////////////////////////////////////////////////////

// fowlerk added
void ApiWeatherGovClient::updateAlerts(String apiKey, String language, String country, String state, String city) {
  currentAlert = 0;
  activeAlertsCnt = 0;
  isForecast = false;
  isSimpleForecast = false;
  isCurrentObservation = false;
  isAlerts = true;
  if (country == "US") {
  isAlertUS = true;
  isAlertEU = false;
  } else {
  isAlertUS = false;
  isAlertEU = true;
  }
  doUpdate("/api/" + apiKey + "/alerts/lang:" + language + "/q/" + country + "/" + city + ".json");
}
// end fowlerk add

void ApiWeatherGovClient::doUpdate(String url) {
  JsonStreamingParser parser;
  parser.setListener(this);
  WiFiClient client;
  const int httpPort = 80;
  if (!client.connect("api.wunderground.com", httpPort)) {
    Serial.println("connection failed");
    return;
  }

  Serial.print("Requesting URL: ");
  Serial.println(url);

  // This will send the request to the server
  client.print(String("GET ") + url + " HTTP/1.1\r\n" +
               "Host: api.weather.gov\r\n" +
               "Connection: close\r\n\r\n");
  int retryCounter = 0;
  while(!client.available()) {
    delay(1000);
    retryCounter++;
    if (retryCounter > 10) {
      return;
    }
  }

  int pos = 0;
  boolean isBody = false;
  char c;

  int size = 0;
  client.setNoDelay(false);
  while(client.connected()) {
    while((size = client.available()) > 0) {
      c = client.read();
      if (c == '{' || c == '[') {
        isBody = true;
      }
      if (isBody) {
        parser.parse(c);
      }
    }
  }
}

void ApiWeatherGovClient::whitespace(char c) {
  Serial.println("whitespace");
}

void ApiWeatherGovClient::startDocument() {
  Serial.println("start document");
}

void ApiWeatherGovClient::key(String key) {
  currentKey = String(key);
//  Restructured following logic to accomodate the multiple types of JSON returns based on the API.  This was necessary since several
//  keys are reused between various types of API calls, resulting in confusing returns in the original function.  Various booleans
//  now indicate whether the JSON stream being processed is part of the text forecast (txt_forecast), the first section of the 10-day
//  forecast API that contains detailed text for the forecast period; the simple forecast (simpleforecast), the second section of the
//  10-day forecast API that contains such data as forecast highs/lows, conditions, precipitation / probabilities; the current
//  observations (current_observation), from the observations API call; or alerts (alerts), for the future) weather alerts API call.
//    Added by fowlerk...18-Dec-2016
  if (currentKey == "txt_forecast") {
  isForecast = true;
  isCurrentObservation = false; // fowlerk
    isSimpleForecast = false;   // fowlerk
  isAlerts = false;       // fowlerk
  }
  if (currentKey == "simpleforecast") {
    isSimpleForecast = true;
  isCurrentObservation = false; // fowlerk
  isForecast = false;       // fowlerk
  isAlerts = false;       // fowlerk
  }
//  Added by fowlerk...
  if (currentKey == "current_observation") {
    isCurrentObservation = true;
  isSimpleForecast = false;
  isForecast = false;
  isAlerts = false;
  }
  if (currentKey == "alerts") {
    isCurrentObservation = false;
  isSimpleForecast = false;
  isForecast = false;
  isAlerts = true;
  }
// end fowlerk add
}

void ApiWeatherGovClient::value(String value) {
  if (currentKey == "local_epoch") {
    localEpoc = value.toInt();
    localMillisAtUpdate = millis();
  }

