mimiflynn/esp8266-current-temp/lib/ApiWeatherGovClient.cpp
  if (currentKey == "dewpoint_f" && !isMetric) {
    dewPoint = value;
  }
  if (currentKey == "dewpoint_c" && isMetric) {
    dewPoint = value;
  }
  if (currentKey == "precip_today_metric" && isMetric) {
    precipitationToday = value + "mm";
  }
  if (currentKey == "precip_today_in" && !isMetric) {
    precipitationToday = value + "in";
  }
  if (currentKey == "period") {
    currentForecastPeriod = value.toInt();
  }
// Modified below line to add check to ensure we are processing the 10-day forecast
// before setting the forecastTitle (day of week of the current forecast day).
// (The keyword title is used in both the current observation and the 10-day forecast.)
//    Modified by fowlerk
  // if (currentKey == "title" && currentForecastPeriod < MAX_FORECAST_PERIODS) {       // Removed, fowlerk
  if (currentKey == "title" && isForecast && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      Serial.println(String(currentForecastPeriod) + ": " + value);
      forecastTitle[currentForecastPeriod] = value;
  }

  // Added forecastText key following...fowlerk, 12/3/16
  if (currentKey == "fcttext" && isForecast && !isMetric && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      forecastText[currentForecastPeriod] = value;
  }
  // Added option for metric forecast following...fowlerk, 12/22/16
  if (currentKey == "fcttext_metric" && isForecast && isMetric && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      forecastText[currentForecastPeriod] = value;
  }
  // end fowlerk add, 12/3/16

  // Added PoP (probability of precipitation) key following...fowlerk, 12/22/16
  if (currentKey == "pop" && isForecast && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      PoP[currentForecastPeriod] = value;
  }
  // end fowlerk add, 12/22/16

  // The detailed forecast period has only one forecast per day with low/high for both
  // night and day, starting at index 1.
  int dailyForecastPeriod = (currentForecastPeriod - 1) * 2;

  if (currentKey == "fahrenheit" && !isMetric && dailyForecastPeriod < MAX_FORECAST_PERIODS) {

      if (currentParent == "high") {
        forecastHighTemp[dailyForecastPeriod] = value;
      }
      if (currentParent == "low") {
        forecastLowTemp[dailyForecastPeriod] = value;
      }
  }
  if (currentKey == "celsius" && isMetric && dailyForecastPeriod < MAX_FORECAST_PERIODS) {

      if (currentParent == "high") {
        Serial.println(String(currentForecastPeriod)+ ": " + value);
        forecastHighTemp[dailyForecastPeriod] = value;
      }
      if (currentParent == "low") {
        forecastLowTemp[dailyForecastPeriod] = value;
      }
  }
  // fowlerk added...to pull month/day from the forecast period
  if (currentKey == "month" && isSimpleForecast && currentForecastPeriod < MAX_FORECAST_PERIODS)  {
  //  Added by fowlerk to handle transition from txtforecast to simpleforecast, as
  //  the key "period" doesn't appear until after some of the key values needed and is
  //  used as an array index.
  if (isSimpleForecast && currentForecastPeriod == 19) {
    currentForecastPeriod = 0;
  }
  forecastMonth[currentForecastPeriod] = value;
  }

  if (currentKey == "day" && isSimpleForecast && currentForecastPeriod < MAX_FORECAST_PERIODS)  {
  //  Added by fowlerk to handle transition from txtforecast to simpleforecast, as
  //  the key "period" doesn't appear until after some of the key values needed and is
  //  used as an array index.
  if (isSimpleForecast && currentForecastPeriod == 19) {
    currentForecastPeriod = 0;
  }
  forecastDay[currentForecastPeriod] = value;
  }
  // end fowlerk add

}

void ApiWeatherGovClient::endArray() {

}


void ApiWeatherGovClient::startObject() {
  currentParent = currentKey;
}

void ApiWeatherGovClient::endObject() {
  currentParent = "";
}

void ApiWeatherGovClient::endDocument() {

}

void ApiWeatherGovClient::startArray() {

}


String ApiWeatherGovClient::getHours() {
    if (localEpoc == 0) {
      return "--";
    }
    int hours = (getCurrentEpoch()  % 86400L) / 3600 + gmtOffset;
    if (hours < 10) {
      return "0" + String(hours);
    }
    return String(hours); // print the hour (86400 equals secs per day)

}
String ApiWeatherGovClient::getMinutes() {
    if (localEpoc == 0) {
      return "--";
    }
    int minutes = ((getCurrentEpoch() % 3600) / 60);
    if (minutes < 10 ) {
      // In the first 10 minutes of each hour, we'll want a leading '0'
      return "0" + String(minutes);
    }
    return String(minutes);
}
String ApiWeatherGovClient::getSeconds() {
    if (localEpoc == 0) {
      return "--";
    }
    int seconds = getCurrentEpoch() % 60;
    if ( seconds < 10 ) {
      // In the first 10 seconds of each minute, we'll want a leading '0'
      return "0" + String(seconds);
    }
    return String(seconds);
}
String ApiWeatherGovClient::getDate() {
  return date;
}
long ApiWeatherGovClient::getCurrentEpoch() {
  return localEpoc + ((millis() - localMillisAtUpdate) / 1000);
}

// JJG added ... /////////////////////////////////////////////////////////////////////////////////////////
String ApiWeatherGovClient::getMoonPctIlum() {
  return moonPctIlum;
}

String ApiWeatherGovClient::getMoonAge() {
  return moonAge;
}

String ApiWeatherGovClient::getMoonPhase() {
  return moonPhase;
}

String ApiWeatherGovClient::getSunriseTime() {
  return sunriseTime;
 }

String ApiWeatherGovClient::getSunsetTime() {
  return sunsetTime;
 }

String ApiWeatherGovClient::getMoonriseTime() {
  return moonriseTime;
 }

String ApiWeatherGovClient::getMoonsetTime() {
  return moonsetTime;
 }

String ApiWeatherGovClient::getWindSpeed() {
  return windSpeed;
 }

String ApiWeatherGovClient::getWindDir() {
  return windDir;
 }

 // end JJG add ////////////////////////////////////////////////////////////////////////////////////////////


String ApiWeatherGovClient::getCurrentTemp() {
  return currentTemp;
}

String ApiWeatherGovClient::getWeatherText() {
  return weatherText;
}

String ApiWeatherGovClient::getHumidity() {
  return humidity;
}

String ApiWeatherGovClient::getPressure() {
  return pressure;
}

String ApiWeatherGovClient::getDewPoint() {
  return dewPoint;
}
// fowlerk added...
String ApiWeatherGovClient::getFeelsLike() {
  return feelslike;
}

String ApiWeatherGovClient::getUV() {
  return UV;
}

// Added by fowlerk, 04-Dec-2016
String ApiWeatherGovClient::getObservationTime() {
  return observationTime;
}

// Active alerts...added 18-Dec-2016
String ApiWeatherGovClient::getActiveAlerts(int alertIndex) {
  return activeAlerts[alertIndex];
}

String ApiWeatherGovClient::getActiveAlertsText(int alertIndex) {
  return activeAlertsText[alertIndex];
}

