mimiflynn/esp8266-current-temp/lib/ApiWeatherGovClient.cpp
String ApiWeatherGovClient::getActiveAlertsMessage(int alertIndex) {
  return activeAlertsMessage[alertIndex];
}

bool ApiWeatherGovClient::getActiveAlertsMessageTrunc(int alertIndex) {
  return activeAlertsMessageTrunc[alertIndex];
}

String ApiWeatherGovClient::getActiveAlertsStart(int alertIndex) {
  return activeAlertsStart[alertIndex];
}

String ApiWeatherGovClient::getActiveAlertsEnd(int alertIndex) {
  return activeAlertsEnd[alertIndex];
}

String ApiWeatherGovClient::getActiveAlertsPhenomena(int alertIndex) {
  return activeAlertsPhenomena[alertIndex];
}

String ApiWeatherGovClient::getActiveAlertsSignificance(int alertIndex) {
  return activeAlertsSignificance[alertIndex];
}

String ApiWeatherGovClient::getActiveAlertsAttribution(int alertIndex) {
  return activeAlertsAttribution[alertIndex];
}

int ApiWeatherGovClient::getActiveAlertsCnt() {
  return activeAlertsCnt;
}

// end fowlerk add


String ApiWeatherGovClient::getPrecipitationToday() {
  return precipitationToday;
}

String ApiWeatherGovClient::getTodayIcon() {
  return getMeteoconIcon(weatherIcon);
}

String ApiWeatherGovClient::getTodayIconText() {
  return weatherIcon;
}

String ApiWeatherGovClient::getForecastIcon(int period) {
  return getMeteoconIcon(forecastIcon[period]);
}

String ApiWeatherGovClient::getForecastTitle(int period) {
  return forecastTitle[period];
}

String ApiWeatherGovClient::getForecastLowTemp(int period) {
  return forecastLowTemp[period];
}

String ApiWeatherGovClient::getForecastHighTemp(int period) {
  return forecastHighTemp[period];
}
// fowlerk added...
String ApiWeatherGovClient::getForecastDay(int period) {
//  Serial.print("Day period:  "); Serial.println(period);
  return forecastDay[period];
}

String ApiWeatherGovClient::getForecastMonth(int period) {
//  Serial.print("Month period:  "); Serial.println(period);
  return forecastMonth[period];
}

String ApiWeatherGovClient::getForecastText(int period) {
//  Serial.print("Forecast period:  "); Serial.println(period);
  return forecastText[period];
}

// Added PoP...12/22/16
String ApiWeatherGovClient::getPoP(int period) {
  return PoP[period];
}
// end fowlerk add


String ApiWeatherGovClient::getMeteoconIcon(String iconText) {
  if (iconText == "chanceflurries") return "F";
  if (iconText == "chancerain") return "Q";
  if (iconText == "chancesleet") return "W";
  if (iconText == "chancesnow") return "V";
  if (iconText == "chancetstorms") return "S";
  if (iconText == "clear") return "B";
  if (iconText == "cloudy") return "Y";
  if (iconText == "flurries") return "F";
  if (iconText == "fog") return "M";
  if (iconText == "hazy") return "E";
  if (iconText == "mostlycloudy") return "Y";
  if (iconText == "mostlysunny") return "H";
  if (iconText == "partlycloudy") return "H";
  if (iconText == "partlysunny") return "J";
  if (iconText == "sleet") return "W";
  if (iconText == "rain") return "R";
  if (iconText == "snow") return "W";
  if (iconText == "sunny") return "B";
  if (iconText == "tstorms") return "0";

  if (iconText == "nt_chanceflurries") return "F";
  if (iconText == "nt_chancerain") return "7";
  if (iconText == "nt_chancesleet") return "#";
  if (iconText == "nt_chancesnow") return "#";
  if (iconText == "nt_chancetstorms") return "&";
  if (iconText == "nt_clear") return "2";
  if (iconText == "nt_cloudy") return "Y";
  if (iconText == "nt_flurries") return "9";
  if (iconText == "nt_fog") return "M";
  if (iconText == "nt_hazy") return "E";
  if (iconText == "nt_mostlycloudy") return "5";
  if (iconText == "nt_mostlysunny") return "3";
  if (iconText == "nt_partlycloudy") return "4";
  if (iconText == "nt_partlysunny") return "4";
  if (iconText == "nt_sleet") return "9";
  if (iconText == "nt_rain") return "7";
  if (iconText == "nt_snow") return "#";
  if (iconText == "nt_sunny") return "4";
  if (iconText == "nt_tstorms") return "&";

  return ")";
}
